{"id":"8b1e2673-4d97-41ad-80e7-1e8d091f3628","updated_at":"2026-04-18T20:09:22.998Z","updated_by":"elastic","created_at":"2026-04-18T19:45:52.406Z","created_by":"elastic","name":"Out of State Login","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"Suspicious log from outside designated region or state. ","risk_score":25,"severity":"low","note":"Monitor account closely unusual or high‑risk activity and correlate login with the user’s recent authentication history.","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://20.65.80.187:5601/app/security"},"investigation_fields":{"field_names":["source.ip"]},"author":["Matt"],"false_positives":[],"from":"now-360s","rule_id":"38a6aa31-dd2e-43ce-81e2-d0f95b12c7fb","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"cabcbd32-a43d-4bbc-8b5d-66c12495e0d0","query":"traefik.access.geoip.region_iso_code : * AND NOT traefik.access.geoip.region_iso_code : \"US-VA\" AND message : \"GET /library/ajax/i18n_generator.php?lang_id=1&csrf_token_form=\"","filters":[],"threshold":{"field":["source.ip"],"value":1,"cardinality":[{"field":"@timestamp","value":1}]},"actions":[{"group":"default","id":"dc51af42-7dd6-4cef-ab2a-b8710bf0bf83","params":{"documents":[{"rule_id":"{{rule.id}}","rule_name":"{{rule.name}}","alert_id":"{{alert.id}}","user":"{{context.group}}","failed_attempt_count":"{{context.value}}","triggered_at":"{{date}}","context_message":"User with IP {{context.group}} successfully loged in outside of designated region."}]},"action_type_id":".index","uuid":"ba2a1d94-78a7-4190-a973-4d410226f222","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null}}]}
{"id":"61b4b0aa-7ab0-4e34-a6a4-dd40f6c428ce","updated_at":"2026-04-18T20:10:09.074Z","updated_by":"elastic","created_at":"2026-04-18T19:02:43.053Z","created_by":"elastic","name":"Failed Logins","tags":[],"interval":"5m","enabled":true,"revision":3,"description":"Multiple failed logins to alert possible brute force attack.","risk_score":50,"severity":"medium","note":"Review location of failed login attempts. Monitor any successful login attempts. ","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://20.65.80.187:5601/app/security"},"investigation_fields":{"field_names":["audit.user.keyword","audit.event_type.keyword","audit.outcome.keyword"]},"author":["Matt"],"false_positives":[],"from":"now-360s","rule_id":"9a272e2f-bd94-4e44-8a0c-d2a2aa5d5959","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"78581c3d-99cf-4736-94ac-e06051c3d239","query":"audit.event_type: \"login\" AND audit.outcome.keyword: \"failure\"","filters":[],"threshold":{"field":["audit.user.keyword"],"value":1,"cardinality":[{"field":"@timestamp","value":3}]},"actions":[{"group":"default","id":"dc51af42-7dd6-4cef-ab2a-b8710bf0bf83","params":{"documents":[{"rule_id":"{{rule.id}}","rule_name":"{{rule.name}}","alert_id":"{{alert.id}}","user":"{{context.group}}","failed_attempt_count":"{{context.value}}","triggered_at":"{{date}}","context_message":"User {{context.group}} had {{context.value}} failed login attempts within threhold window."}]},"action_type_id":".index","uuid":"6ea7650f-38d1-4aea-9de3-b14f92cd752d","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null}}]}
{"id":"a85c4079-bd3a-4462-ac8d-4bc12deea921","updated_at":"2026-04-17T19:31:35.850Z","updated_by":"elastic","created_at":"2026-04-17T19:31:35.850Z","created_by":"elastic","name":"Clinician Access to Patient Records","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Detects potential misuse of patient records by alerting on a set number of unique patients accessed in over a period of time. ","risk_score":75,"severity":"high","note":"Review access logs for user to investigate potential misuse of patient records.","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://20.62.64.33:5601/app/security"},"investigation_fields":{"field_names":["audit.user.keyword","@timestamp","audit.patient_id.keyword"]},"author":["Matt"],"false_positives":[],"from":"now-360s","rule_id":"127531cf-bae5-4996-9931-3707f42f200a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0010","name":"Exfiltration","reference":"https://attack.mitre.org/tactics/TA0010"},"technique":[]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"0bd8852f-1ebf-455f-a427-0183ba05e98a","query":"NOT audit.patient_id.keyword : \"-\" AND NOT audit.user.keyword : \"OpenEMR\"","filters":[],"threshold":{"field":["audit.user.keyword"],"value":1,"cardinality":[{"field":"audit.patient_id.keyword","value":4}]},"actions":[{"group":"default","id":"dc51af42-7dd6-4cef-ab2a-b8710bf0bf83","params":{"documents":[{"alert_type":"multi_patient_access","user":"{{context.group}}","unique_patient_count":"{{context.value}}","threshold":3,"time_window_minutes":5,"triggered_at":"{{date}}","rule_name":"{{rule.name}}","rule_id":"{{rule.id}}"}]},"action_type_id":".index","uuid":"b0f7564d-6ad7-41e9-8a88-407c5c7395ce","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null}}]}
{"id":"dc51af42-7dd6-4cef-ab2a-b8710bf0bf83","type":"action","updated_at":"2026-04-17T15:11:40.322Z","created_at":"2026-04-17T15:11:40.322Z","version":"WzgsMjJd","attributes":{"actionTypeId":".index","name":"alerts-user-snooping","isMissingSecrets":false,"config":{"index":"patient-snooping-alerts","refresh":false,"executionTimeField":null},"secrets":{}},"references":[],"managed":false,"coreMigrationVersion":"8.8.0","typeMigrationVersion":"8.3.0"}
{"exported_count":4,"exported_rules_count":3,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":1,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
